## Dataframes

In [7]:
from pandas import DataFrame

In [11]:
data = {"Estado": ["Santa Catarina", "Paraná", "Goiás", "Bahia", "Minas Gerais"],
        "Ano": list(range(2002, 2007)),
        "População": [1.5, 1.7, 3.6, 2.4, 2.9]}

data

{'Estado': ['Santa Catarina', 'Paraná', 'Goiás', 'Bahia', 'Minas Gerais'],
 'Ano': [2002, 2003, 2004, 2005, 2006],
 'População': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [13]:
df = DataFrame(data)

df

           Estado   Ano  População
0  Santa Catarina  2002        1.5
1          Paraná  2003        1.7
2           Goiás  2004        3.6
3           Bahia  2005        2.4
4    Minas Gerais  2006        2.9

In [15]:
#--- Renomeando as colunas

DataFrame(data = data, columns = ["Ano", "Estado", "População"])

    Ano          Estado  População
0  2002  Santa Catarina        1.5
1  2003          Paraná        1.7
2  2004           Goiás        3.6
3  2005           Bahia        2.4
4  2006    Minas Gerais        2.9

In [17]:
DataFrame(data = data, columns = ["Ano", "Estado", "População"], index = ["Um", "Dois", "Três", "Quatro", "Cinco"])

         Ano          Estado  População
Um      2002  Santa Catarina        1.5
Dois    2003          Paraná        1.7
Três    2004           Goiás        3.6
Quatro  2005           Bahia        2.4
Cinco   2006    Minas Gerais        2.9

In [21]:
dados = DataFrame(data = data, columns = ["Ano", "Estado", "População", "Débito"], index = ["Um", "Dois", "Três", "Quatro", "Cinco"])

dados

         Ano          Estado  População Débito
Um      2002  Santa Catarina        1.5    NaN
Dois    2003          Paraná        1.7    NaN
Três    2004           Goiás        3.6    NaN
Quatro  2005           Bahia        2.4    NaN
Cinco   2006    Minas Gerais        2.9    NaN

In [22]:
dados["População"]

Um        1.5
Dois      1.7
Três      3.6
Quatro    2.4
Cinco     2.9
Name: População, dtype: float64

## Usando Numpy + Pandas

In [23]:
import numpy as np

In [25]:
dados["Débito"] = np.arange(5)

dados

         Ano          Estado  População  Débito
Um      2002  Santa Catarina        1.5       0
Dois    2003          Paraná        1.7       1
Três    2004           Goiás        3.6       2
Quatro  2005           Bahia        2.4       3
Cinco   2006    Minas Gerais        2.9       4

In [27]:
dados.describe()

               Ano  População    Débito
count     5.000000   5.000000  5.000000
mean   2004.000000   2.420000  2.000000
std       1.581139   0.864292  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2004.000000   2.400000  2.000000
75%    2005.000000   2.900000  3.000000
max    2006.000000   3.600000  4.000000

In [38]:
dados["População"] < 5

Um        True
Dois      True
Três      True
Quatro    True
Cinco     True
Name: População, dtype: bool

### Localizando registros dentro do DF

In [40]:
dados.loc["Quatro"]

Ano           2005
Estado       Bahia
População      2.4
Débito           3
Name: Quatro, dtype: object

In [43]:
dados.iloc[2]

Ano           2004
Estado       Goiás
População      3.6
Débito           2
Name: Três, dtype: object

In [45]:
print(df.set_index('Ano'))

              Estado  População
Ano
2002  Santa Catarina        1.5
2003          Paraná        1.7
2004           Goiás        3.6
2005           Bahia        2.4
2006    Minas Gerais        2.9